#+title: Posts to make

* TODO Post on using devcontainer-cli and tramp
https://www.emacswiki.org/emacs/TrampAndDocker
https://code.visualstudio.com/docs/devcontainers/devcontainer-cli
https://devenv.sh/integrations/codespaces-devcontainer/
* TODO Blog post about whole lotta love
* TODO Write a blog post of eg vs ie
* TODO "So what's your phd research project?"
* TODO Write a blog post about my ADHD diagnosis
How many words have I written in my journal files since March?
** TODO Send Russ Barkley my blog post when I finish

** [[id:7bebbf55-4c83-4db3-b08b-f03804b112ca][In the words of the first pysch I saw "how's he halfway through a phd program?"]]

** How my wife felt most days
[[id:acb8ac57-caed-42ef-abaf-dffa45d37478][Seeing time dog]]

https://www.getyarn.io/yarn-clip/e490c2eb-25c2-4ea7-813f-bd7b4025b191#u9DkXlnB.copy
https://www.getyarn.io/yarn-clip/3d49a291-18e6-4905-9bba-b116576e4440
https://www.getyarn.io/yarn-clip/b5949e53-0a44-43f8-8c0f-2068b2d0179f#fLbb658Q.copy
https://www.getyarn.io/yarn-clip/e292bf6f-7d5e-473b-af9a-a7babd48bea1#utXYVTUQ.copy
https://www.getyarn.io/yarn-clip/2ee94044-a423-4116-9fb1-b36bb1daec29#4OOnESQq.copy
https://www.getyarn.io/yarn-clip/1bffb16f-bf01-4495-8b96-a785e4311fa9#0Sha-0m9.copy
https://www.getyarn.io/yarn-clip/3c220b1a-e69c-4a3d-acb9-9f750ccede39#jP4C2thU.copy
https://www.getyarn.io/yarn-clip/b4590868-deac-429b-8b84-c1decdf34fac#m-420elC.copy
* TODO Write a post of things I wish people understood about ADHD
* TODO Emacs and Julia
https://old.reddit.com/r/Julia/comments/v4npic/setting_up_emacs_for_julia_in_windows_seeking/
[[https://old.reddit.com/r/Julia/comments/w1b28y/emacs_for_julia_development/][Emacs for julia development? : Julia]]
* TODO Functional programming principals to apply to bioinformatics
* TODO Functional programming and nextflow
* TODO Org mode site rewrite
* TODO Comparing the different Plots.jl backends
* TODO Julia testing
:LOGBOOK:
CLOCK: [2022-06-16 Thu 21:30]--[2022-06-16 Thu 22:47] =>  1:17
:END:
https://www.endpointdev.com/blog/2020/11/rapid-tdd-in-julia/

https://www.juliapackages.com/p/pkgtemplates
https://www.youtube.com/watch?v=n-UP_Ul-JjE
https://juliatesting.github.io/ReTest.jl/stable/
https://discourse.julialang.org/t/best-practices-for-julia-unit-testing/30858
https://docs.julialang.org/en/v1/stdlib/Test/

https://www.youtube.com/watch?v=IuwxE3m0_QQ
https://github.com/hoodie/awesome-rust-testing
* TODO Rust and Julia comparison
https://miguelraz.github.io/blog/juliatorust/
* DONE Julia for bioinformatics
CLOSED: [2022-06-01 Wed 14:28]
:LOGBOOK:
CLOCK: [2022-06-01 Wed 13:30]--[2022-06-01 Wed 14:29] =>  0:59
CLOCK: [2022-06-01 Wed 12:00]--[2022-06-01 Wed 12:30] =>  0:30
CLOCK: [2022-03-31 Thu 12:22]--[2022-03-31 Thu 13:45] =>  1:23
CLOCK: [2022-03-31 Thu 11:58]--[2022-03-31 Thu 12:04] =>  0:06
:END:

* KILL Blog about Kedro vs Ploomber :blog:
CLOSED: [2022-10-15 Sat 17:24]


* TODO Solving Jupyter reproducibility post
https://www.fast.ai/2022/08/25/jupyter-git/

* TODO nextflow-sql and duckdb blog post
https://duckdb.org/2022/05/04/friendlier-sql.html
Use motherduck now that I have access
https://motherduck.com/docs/authenticating-to-motherduck#authentication-using-saas-mode
* TODO ADHD blog posts

Point out my "I'm going to start a writing streak blog post". Leave it up there
as a reminder. The irony.

** TODO Neurodivergence and software
The draw of finally being able to create the tools you need.
* TODO Ob-sql and duck DB
* TODO Julia packages and Nextflow
* TODO Julia packages and Snakemake

* State of ml follow up

- Implement liver-ct-segmentation
- Reproduce [[https://github.com/instadeepai/nucleotide-transformer/tree/main][nucleotide-transformer]]

* DONE Look into staging files out with rclone in Nextflow
CLOSED: [2023-09-29 Fri 18:21]
:LOGBOOK:
CLOCK: [2023-09-28 Thu 17:44]--[2023-09-28 Thu 18:21] =>  0:37
:END:


* TODO Make a quick blog post on dev containers in Julia

* TODO ChatGPT in 50 lines of Julia :blog:
https://news.ycombinator.com/item?id=34726115
** STRT [[https://news.ycombinator.com/item?id=34726115][A GPT in 60 Lines of NumPy | Hacker News]]
:LOGBOOK:
CLOCK: [2023-03-03 Fri 10:16]--[2023-03-03 Fri 10:45] =>  0:29
CLOCK: [2023-03-02 Thu 22:12]--[2023-03-02 Thu 22:30] =>  0:18
:END:
https://jalammar.github.io/how-gpt3-works-visualizations-animations/

* TODO Build something like ~curl -L manzt.sh~

* TODO [[https://github.com/broadinstitute/ABC-Enhancer-Gene-Prediction][GitHub - broadinstitute/ABC-Enhancer-Gene-Prediction: Cell type specific enha...]]

Reproduce in Julia


* IDEA Blog post on farming jobs out from HPC cluster to the GPU nodes
:PROPERTIES:
:CREATED:  [2023-10-02 Mon 14:37]
:END:
